feat: use mermaid diagram
